


export const Messages = {
// پیام‌های احراز هویت:
// loginSuccess: "شما با موفقیت وارد شدید."
logoutSuccess: "شما با موفقیت خارج شدید.",
// incorrectCredentials: "ایمیل یا رمز عبور وارد شده اشتباه است. لطفاً دوباره امتحان کنید."
// accountLocked: "حساب شما به دلیل تلاش‌های ناموفق متعدد قفل شده است. لطفاً رمز عبور خود را بازنشانی کنید یا با پشتیبانی تماس بگیرید."
// passwordResetEmailSent: "لینک بازنشانی رمز عبور به ایمیل شما ارسال شد."
// passwordChangeSuccess: "رمز عبور شما با موفقیت تغییر یافت."
// پیام‌های اعتبارسنجی فرم:
requiredField: "این فیلد الزامی است.",
// invalidEmail: "لطفاً یک ایمیل معتبر وارد کنید."
// passwordTooShort: "رمز عبور باید حداقل 8 کاراکتر باشد."
// passwordsDoNotMatch: "رمزهای عبور مطابقت ندارند."
// exceedsCharacterLimit: "این فیلد از حد مجاز کاراکترها بیشتر است."
// پیام‌های موفقیت:
operationSuccess: "عملیات با موفقیت انجام شد.",
// changesSaved: "تغییرات با موفقیت ذخیره شد."
// dataSubmitted: "داده‌های شما با موفقیت ارسال شد."
// پیام‌های خطا:
operationError: "مشکلی پیش آمد. لطفاً دوباره امتحان کنید.",
dataLoadError: "بارگذاری داده‌ها ناموفق بود.",
// requestTimeout: "درخواست بیش از حد طول کشید. لطفاً دوباره امتحان کنید."
// حالت‌های خالی:
noRecordsFound: "هیچ رکوردی یافت نشد.",
// tableEmpty: "این جدول در حال حاضر خالی است."
// noTasks: "در حال حاضر هیچ وظیفه‌ای موجود نیست."
// پیام‌های اعلان:
// newNotification: "شما یک اعلان جدید دارید."
// reminderToMarkAttendance: "فراموش نکنید که حضور خود را تایید کنید!"
// پیام‌های تأیید:
deleteConfirmation: "آیا مطمئن هستید که می‌خواهید این آیتم را حذف کنید؟",
// logoutConfirmation: "آیا مطمئن هستید که می‌خواهید خارج شوید؟"
// unsavedChanges: "شما تغییرات ذخیره‌نشده دارید. آیا مطمئن هستید که می‌خواهید بدون ذخیره خارج شوید؟"
// پیام‌های بارگذاری و پیشرفت:
// loadingData: "در حال بارگذاری داده‌ها، لطفاً صبر کنید..."
// submittingData: "در حال ارسال، لطفاً صبر کنید..."
// پیام‌های جستجو و فیلتر:
// noSearchResults: "هیچ نتیجه‌ای برای جستجوی شما پیدا نشد."
// filtersCleared: "فیلترها پاک شدند."
option_Message:'انتخاب کنید',
deleteMessage_modal:({name,nameValue,code}:any)=>
    `آیا از حذف ${name} ${nameValue} 
    ${code ? `با کد ${code}`:''} 
    اطمینان دارید؟`
}
